#+title: Laboratorium 11 - Całkowanie Monte Carlo
#+date: 11.06.2024r.
#+author: Piotr Karamon
#+setupfile: ../setupfile.org

** Zdefiniowanie potrzebnych funkcji i stałych
#+begin_src python :exports none :session a
import numpy as np
import matplotlib.pyplot as plt
import scienceplots
import pandas as pd
import sympy as sp

plt.style.use('science')
#+end_src

#+RESULTS:
: None

#+begin_src python :session a
def f(x):
    return x**2 + x +1

def g(x):
    return np.sqrt(1-x**2)

def h(x):
    return 1/np.sqrt(x)
#+end_src

#+RESULTS:


#+begin_src python :session a :results output :wrap example :exports both
x = sp.symbols('x')

f_int = float(sp.integrate(x**2 + x + 1, (x, 0,1)))
g_int = float(sp.integrate(sp.sqrt(1-x**2), (x, 0,1)))
h_int = float(sp.integrate(1/sp.sqrt(x), (x, 0,1)))


for f_name, integral in zip(['f', 'g', 'h'], [f_int, g_int, h_int]):
    print(f'I({f_name}) = {integral}')
#+end_src

#+RESULTS:
#+begin_example
I(f) = 1.8333333333333333
I(g) = 0.7853981633974483
I(h) = 2.0
#+end_example

